
Функция СоздатьБазовогоПользователя() Экспорт
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда
		НовыйАдминистратор = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйАдминистратор.Имя = "admin";
		НовыйАдминистратор.АутентификацияСтандартная = Истина;
		НовыйАдминистратор.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		НовыйАдминистратор.Пароль = "nimda";
		НовыйАдминистратор.ПоказыватьВСпискеВыбора = Истина;
		НовыйАдминистратор.ПолноеИмя = "admin";
		НовыйАдминистратор.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		ДополнитьРоли(НовыйАдминистратор.Роли);
		НовыйАдминистратор.Записать();
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Процедура ДополнитьРоли(МассивРолей)
	
КонецПроцедуры
